In [1]:
#Pandas is used for data manipulation and analysis
#Panas is made up of series and DataFrames
#Series are just like arrays, but with index values
#DataFrame is a group of series occuring together

In [10]:
import pandas as pd
import numpy as np

In [11]:
#Creating series
li_a = [10,20,30,40]

ser = pd.Series(li_a)

In [12]:
ser

0    10
1    20
2    30
3    40
dtype: int64

In [13]:
from numpy.random import randn

In [14]:
np_d = np.arange(1,5)

In [16]:
ser2 = pd.Series(np_d)

In [17]:
ser2

0    1
1    2
2    3
3    4
dtype: int64

In [20]:
sl = ['a','b','c','d']
ser = pd.Series(li_a,sl)

In [21]:
ser

a    10
b    20
c    30
d    40
dtype: int64

In [23]:
dictionary = {
    'a': (100,110,120),
    'b': (200,210,220),
    'c': (300,310,320)
    
}

In [26]:
ser3 = pd.Series(dictionary)

In [27]:
ser3

a    (100, 110, 120)
b    (200, 210, 220)
c    (300, 310, 320)
dtype: object

In [28]:
#DataFrame is a two dimensional structure
import numpy as np 
import pandas as pd

In [31]:
from numpy.random import randn

In [44]:
np.random.seed(102)
#DataFrame of 3 rows by 4 colums
#first arg is data source, second is row, third is columns
df = pd.DataFrame(randn(3,4),index = ['a','b','c'], columns = ['i','ii','iii','iv'])

In [50]:
df[['ii','iii']]

         ii       iii
a  0.925862  1.057997
b  0.331183 -0.509845
c -2.238203  0.973165

In [51]:
df['i']

a    1.668068
b    1.299748
c   -0.130016
Name: i, dtype: float64

In [52]:
df.loc['a']

i      1.668068
ii     0.925862
iii    1.057997
iv    -0.920339
Name: a, dtype: float64

In [60]:
df.loc[['a'],['i','ii']]

          i        ii
a  1.668068  0.925862

In [61]:
df.iloc[0][['i','ii']]

i     1.668068
ii    0.925862
Name: a, dtype: float64

In [58]:
df.iloc[[0],[0,1]]

          i        ii
a  1.668068  0.925862

In [75]:
 df ['new'] = np.linspace(-0.5,0.5,4)

In [76]:
df.loc['d'] = np.linspace(-0.5,0.5,5)

In [77]:
df

          i        ii       iii        iv       new
a  1.668068  0.925862  1.057997 -0.920339 -0.500000
b  1.299748  0.331183 -0.509845 -0.903099 -0.166667
c -0.130016 -2.238203  0.973165 -0.024185  0.166667
d -0.500000 -0.250000  0.000000  0.250000  0.500000

In [79]:
df.drop('new',axis=1)

          i        ii       iii        iv
a  1.668068  0.925862  1.057997 -0.920339
b  1.299748  0.331183 -0.509845 -0.903099
c -0.130016 -2.238203  0.973165 -0.024185
d -0.500000 -0.250000  0.000000  0.250000

In [81]:
df

          i        ii       iii        iv       new
a  1.668068  0.925862  1.057997 -0.920339 -0.500000
b  1.299748  0.331183 -0.509845 -0.903099 -0.166667
c -0.130016 -2.238203  0.973165 -0.024185  0.166667
d -0.500000 -0.250000  0.000000  0.250000  0.500000

In [82]:
df.drop('new',axis=1,inplace=True)

In [83]:
df

          i        ii       iii        iv
a  1.668068  0.925862  1.057997 -0.920339
b  1.299748  0.331183 -0.509845 -0.903099
c -0.130016 -2.238203  0.973165 -0.024185
d -0.500000 -0.250000  0.000000  0.250000

In [115]:
df[df>=1].loc[['a']]

          i  ii       iii  iv
a  1.668068 NaN  1.057997 NaN

In [89]:
np.random.seed(32)
sales = np.random.randint(0,50,120)

In [90]:
sales

array([23, 43,  5, 24, 19,  7, 25,  3, 37, 42,  9,  4, 11, 17,  3,  1, 34,
       35, 24, 42, 18, 10, 20, 36, 36,  5, 38, 13, 11, 11, 26, 29, 29, 26,
       47,  0, 11,  6, 46, 30,  4, 41, 30, 16, 19, 37, 10, 35, 45, 24, 47,
       11, 29, 47, 43, 11, 34, 41, 43, 49,  4, 28, 48, 20, 18, 17, 34, 16,
       18, 14, 25,  6, 14, 31,  0, 44, 14, 41, 15,  1, 48, 14, 19, 33, 12,
        7, 40, 14,  6,  6, 42, 34, 40, 17, 36,  8, 25,  9, 18, 17, 31, 18,
       32,  4,  0,  7,  0, 48, 30, 35, 18, 20,  8,  2, 37,  8, 14, 28, 25,
       18])

In [94]:
sales_data = sales.reshape(10,12)

In [98]:
personnel = ['Jennifer','John','Musa', 'Enoh', 'Douglas', 'Adamu', 'Sarah', ' Dupe', 'Michael', 'Grace']

In [99]:
months = ['January', 'February', 'March', 'April', 'May,', 'June', 'July', 'August', 'September', 'October','November','December']

In [101]:
ex = pd.DataFrame(sales_data,personnel,months)

In [102]:
ex

,January,February,March,April,"May,",June,July,August,September,October,November,December
Jennifer,23,43,5,24,19,7,25,3,37,42,9,4
John,11,17,3,1,34,35,24,42,18,10,20,36
Musa,36,5,38,13,11,11,26,29,29,26,47,0
Enoh,11,6,46,30,4,41,30,16,19,37,10,35
Douglas,45,24,47,11,29,47,43,11,34,41,43,49
Adamu,4,28,48,20,18,17,34,16,18,14,25,6
Sarah,14,31,0,44,14,41,15,1,48,14,19,33
Dupe,12,7,40,14,6,6,42,34,40,17,36,8
Michael,25,9,18,17,31,18,32,4,0,7,0,48
Grace,30,35,18,20,8,2,37,8,14,28,25,18

In [104]:
ex[ex>=1]

,January,February,March,April,"May,",June,July,August,September,October,November,December
Jennifer,23,43,5.0,24,19,7,25,3,37.0,42,9.0,4.0
John,11,17,3.0,1,34,35,24,42,18.0,10,20.0,36.0
Musa,36,5,38.0,13,11,11,26,29,29.0,26,47.0,NaN
Enoh,11,6,46.0,30,4,41,30,16,19.0,37,10.0,35.0
Douglas,45,24,47.0,11,29,47,43,11,34.0,41,43.0,49.0
Adamu,4,28,48.0,20,18,17,34,16,18.0,14,25.0,6.0
Sarah,14,31,NaN,44,14,41,15,1,48.0,14,19.0,33.0
Dupe,12,7,40.0,14,6,6,42,34,40.0,17,36.0,8.0
Michael,25,9,18.0,17,31,18,32,4,NaN,7,NaN,48.0
Grace,30,35,18.0,20,8,2,37,8,14.0,28,25.0,18.0

In [116]:
ex.loc[['Grace']]

,January,February,March,April,"May,",June,July,August,September,October,November,December
Grace,30,35,18,20,8,2,37,8,14,28,25,18

In [122]:
oct_max = max(ex['October'])

In [123]:
for oct_max in ex:
    print ex.loc[]

SyntaxError: Missing parentheses in call to 'print'. Did you mean print(ex.loc[])? (<ipython-input-123-68479e5d081f>, line 2)

In [143]:
max_oct = ex[ex==oct_max]['October']

In [144]:
max(max_oct)

42.0